Tekla.Structures.DialogInternal.RebarDialogOwner
For internal use only !
Class to handle native dialog instance

Tekla.Structures.DialogInternal.RebarDialogOwner.#ctor(Tekla.Structures.DialogInternal.IDialogOwner)
Construct instance to hold the native dialog handle
dialogHandle: Handle to native dialog

Tekla.Structures.DialogInternal.RebarDialogOwner.Dispose
Dispose implementation for inp dialog

Tekla.Structures.DialogInternal.RebarDialogOwner.OnValueChanged(Tekla.Structures.DialogInternal.RebarAttributes)
Process value changed event
attributes: Rebar attributes

Tekla.Structures.DialogInternal.RebarDialogOwner.OnValueChanged(System.Object)
Event handler for passing generic catalog data back to dialog
data: value data